# **DS 6001: Lab Assignment 7**
## **Randa Ampah**

In [1]:
import numpy as np
import pandas as pd
import sys
import os
import requests
import psycopg
import pymongo
import json
from bson.json_util import dumps, loads
from sqlalchemy import create_engine
import dotenv

## **Problem 1**

### **Part A**

In [2]:
# Data Lemur
'''
SELECT candidate_id
FROM candidates
WHERE skill IN ('Python','Tableau','PostgreSQL')
GROUP BY candidate_id
HAVING COUNT(*) = 3
'''

"\nSELECT candidate_id\nFROM candidates\nWHERE skill IN ('Python','Tableau','PostgreSQL')\nGROUP BY candidate_id\nHAVING COUNT(*) = 3\n"

### **Part B**

For LeetCode, when an answer is accepted, a histogram pops up visualizing the distribution of the amount of time it took people to complete this question and where you fall in this distribution.

### **Part C**

In [3]:
# StrataScratch

'''
WITH max_dept AS (
    SELECT department_id, MAX(salary) as max_sal
    FROM db_employee
    WHERE department_id IN (1,4)
    GROUP BY department_id)
SELECT ABS(MAX(max_sal) - MIN(max_sal)) as diff
FROM max_dept;
'''

'\nWITH max_dept AS (\n    SELECT department_id, MAX(salary) as max_sal\n    FROM db_employee\n    WHERE department_id IN (1,4)\n    GROUP BY department_id)\nSELECT ABS(MAX(max_sal) - MIN(max_sal)) as diff\nFROM max_dept;\n'

### **Part D**

As I read the article, I felt a bit of sadness from how a lot of the students interviewed were using ChatGPT for everything. I'm not going to say I've never used it for any assignment at all, because that would be a lie, but it seems a lot of the students are using it to replace learning instead of supplementing it. I have noticed just going through life that a lot of people are becoming increasingly reliant on Chat for everything, even solving emotional issues, which should be an inherantly human action. I find the extent to which Lee wants to implement AI into every day life a bit concerning. The end of the article that talked about the advertisement he created where the young man was on a date with a girl and was using Cluely to reference information about her felt a bit dystopian. Even if it was just meant to be a controversial ad, it raises fears for the future and begs the question of whether or not there will even be any "utility" in interacting with other humans and their handiwork meaningfully if AI gets to the point that it can do literally everything. And if it doesn't get to that point, where do we draw the line of where it should stop?

## **Problem 2**

### **Part A**

In [12]:
dotenv.load_dotenv()

# PostgreSQL
POSTGRES_PASSWORD = os.getenv('POSTGRES_PASSWORD')
dbserver = psycopg.connect(
    user='postgres', 
    password=POSTGRES_PASSWORD, 
    host='localhost',
    port = '5432'
)
dbserver.autocommit = True

In [13]:
cursor = dbserver.cursor()

In [ ]:
dbms = 'postgresql'
package = 'psycopg'
user = 'postgres'
password = POSTGRES_PASSWORD
host = 'localhost'
port = '5432'
db = 'shakesdb'

engine = create_engine(f"{dbms}+{package}://{user}:{password}@{host}:{port}/{db}")
engine

Engine(postgresql+psycopg://postgres:***@localhost:5432/shakesdb)

In [ ]:
pquery = '''
SELECT *
FROM works
'''
pd.read_sql_query(pquery, con=engine).head()

,workid,title,longtitle,date,genretype,notes,source,totalwords,totalparagraphs
0,12night,Twelfth Night,"Twelfth Night, Or What You Will",1599,c,None,Moby,19837,1031
1,allswell,All's Well That Ends Well,All's Well That Ends Well,1602,c,None,Moby,22997,1025
2,antonycleo,Antony and Cleopatra,Antony and Cleopatra,1606,t,None,Moby,24905,1344
3,asyoulikeit,As You Like It,As You Like It,1599,c,None,Gutenberg,21690,872
4,comedyerrors,Comedy of Errors,The Comedy of Errors,1589,c,None,Moby,14692,661

### **Part B**

#### Step I

In [ ]:
s1 = '''
SELECT title, date AS year
FROM works
'''

pd.read_sql_query(s1, con=engine).head()

                       title  year
0              Twelfth Night  1599
1  All's Well That Ends Well  1602
2       Antony and Cleopatra  1606
3             As You Like It  1599
4           Comedy of Errors  1589

#### Step II

In [ ]:
s2 = '''
SELECT title, date AS year,
CASE WHEN date < 1600 THEN 'early'
WHEN date >= 1600 AND date <= 1607 THEN 'middle'
ELSE 'late'
END AS era
FROM works
'''

pd.read_sql_query(s2, con=engine).head()

                       title  year     era
0              Twelfth Night  1599   early
1  All's Well That Ends Well  1602  middle
2       Antony and Cleopatra  1606  middle
3             As You Like It  1599   early
4           Comedy of Errors  1589   early

#### Step III

In [ ]:
s3 = '''
SELECT AVG(totalwords) as average_total_words,
CASE WHEN date < 1600 THEN 'early'
WHEN date >= 1600 AND date <= 1607 THEN 'middle'
ELSE 'late'
END AS era
FROM works
GROUP BY era
'''

pd.read_sql_query(s3, con=engine).head()

   average_total_words     era
0         18905.571429    late
1         20328.500000   early
2         21999.416667  middle

The hypothesis is partially supported. The average length of his works did go up from the early to middle eras, but his late era works were on average shorter than all of the earlier eras.

### **Part C**

#### Step I

In [ ]:
q1 = '''
SELECT * 
FROM works
INNER JOIN paragraphs ON works.workid = paragraphs.workid
'''
pd.read_sql_query(q1, con=engine).head()

,workid,title,longtitle,date,genretype,notes,source,totalwords,totalparagraphs,workid,paragraphid,paragraphnum,charid,plaintext,phonetictext,stemtext,charcount,wordcount,chapterid
0,12night,Twelfth Night,"Twelfth Night, Or What You Will",1599,c,None,Moby,19837,1031,12night,630863,3,xxx,"[Enter DUKE ORSINO, CURIO, and other Lords; Mu...",ENTR TK ORSN KR ANT O0R LRTS MSXNS ATNTNK,enter duke orsino curio and other lord musicia...,65.0,9.0,18704.0
1,12night,Twelfth Night,"Twelfth Night, Or What You Will",1599,c,None,Moby,19837,1031,12night,630864,4,ORSINO,"If music be the food of love, play on;\n[p]Giv...",IF MSK B 0 FT OF LF PL ON JF M EKSSS OF IT 0T ...,if music be the food of love plai on give me e...,646.0,114.0,18704.0
2,12night,Twelfth Night,"Twelfth Night, Or What You Will",1599,c,None,Moby,19837,1031,12night,630865,19,CURIO,"Will you go hunt, my lord?\n",WL Y K HNT M LRT,will you go hunt my lord,27.0,6.0,18704.0
3,12night,Twelfth Night,"Twelfth Night, Or What You Will",1599,c,None,Moby,19837,1031,12night,630866,20,ORSINO,"What, Curio?\n",HT KR,what curio,13.0,2.0,18704.0
4,12night,Twelfth Night,"Twelfth Night, Or What You Will",1599,c,None,Moby,19837,1031,12night,630867,21,CURIO,The hart.\n,0 HRT,the hart,10.0,2.0,18704.0

#### Step II

In [ ]:
q2 = '''
WITH paraworks
AS (SELECT * 
    FROM works
    INNER JOIN paragraphs ON works.workid = paragraphs.workid)
SELECT title, plaintext,wordcount,
CASE WHEN date < 1600 THEN 'before 1600'
ELSE '1600 ot later'
END AS era
FROM paraworks
'''

pd.read_sql_query(q2, con=engine).head()

,title,plaintext,wordcount,era
0,Twelfth Night,[Exit],1.0,before 1600
1,Twelfth Night,[Sings]\n[p]When that I was and a little tiny ...,124.0,before 1600
2,Twelfth Night,"[Exeunt all, except Clown]\n",4.0,before 1600
3,Twelfth Night,Pursue him and entreat him to a peace:\n[p]He ...,70.0,before 1600
4,Twelfth Night,He hath been most notoriously abused.\n,6.0,before 1600

#### Step III

In [ ]:
q2 = '''
WITH paraworks
AS (SELECT * 
    FROM works
    INNER JOIN paragraphs ON works.workid = paragraphs.workid)
SELECT AVG(wordcount) as avg_word_count,
CASE WHEN date < 1600 THEN 'before 1600'
ELSE '1600 or later'
END AS era
FROM paraworks
GROUP BY era
'''

pd.read_sql_query(q2, con=engine).head()

   avg_word_count            era
0       25.917012    before 1600
1       23.815456  1600 or later

Though the difference is small (~ 2 words), there is evidence to support that Shakespeare wrote shorter lines of dialogue starting in 1600.

### **Part D**

#### Step I

In [ ]:
st1 = '''
SELECT workid, plaintext,
CASE WHEN LOWER(plaintext) LIKE '%%bright%%' OR
            LOWER(plaintext) LIKE '%%kinder%%' OR
            LOWER(plaintext) LIKE '%%rapt%%' OR
            LOWER(plaintext) LIKE '%%satisfied%%' OR
            LOWER(plaintext) LIKE '%%success%%' OR
            LOWER(plaintext) LIKE '%%virtues%%' OR
            LOWER(plaintext) LIKE '%%wise%%' OR
            LOWER(plaintext) LIKE '%%hero%%' OR
            LOWER(plaintext) LIKE '%%love%%' OR
            LOWER(plaintext) LIKE '%%hope%%' OR
            LOWER(plaintext) LIKE '%%relief%%' 
    THEN 1
ELSE 0
END AS pleasant_line
FROM paragraphs
'''

pd.read_sql_query(st1, con=engine).head()

    workid                                          plaintext  pleasant_line
0  12night  [Enter DUKE ORSINO, CURIO, and other Lords; Mu...              0
1  12night  If music be the food of love, play on;\n[p]Giv...              1
2  12night                       Will you go hunt, my lord?\n              0
3  12night                                     What, Curio?\n              0
4  12night                                        The hart.\n              0

#### Step II

In [ ]:
st2 = '''
WITH pleasants AS(SELECT workid, plaintext,
                    CASE WHEN LOWER(plaintext) LIKE '%%bright%%' OR
                        LOWER(plaintext) LIKE '%%kinder%%' OR
                        LOWER(plaintext) LIKE '%%rapt%%' OR
                        LOWER(plaintext) LIKE '%%satisfied%%' OR
                        LOWER(plaintext) LIKE '%%success%%' OR
                        LOWER(plaintext) LIKE '%%virtues%%' OR
                        LOWER(plaintext) LIKE '%%wise%%' OR
                        LOWER(plaintext) LIKE '%%hero%%' OR
                        LOWER(plaintext) LIKE '%%love%%' OR
                        LOWER(plaintext) LIKE '%%hope%%' OR
                        LOWER(plaintext) LIKE '%%relief%%' 
                    THEN 1
                    ELSE 0
                    END AS pleasant_line
                FROM paragraphs)
SELECT workid, AVG(pleasant_line) as avg_pleasant_line
FROM pleasants
GROUP BY workid
'''

pd.read_sql_query(st2, con=engine).head()

         workid  avg_pleasant_line
0       12night           0.083414
1      allswell           0.090732
2    antonycleo           0.053571
3   asyoulikeit           0.141055
4  comedyerrors           0.045386

#### Step III

In [ ]:
st3 = '''
WITH avg_pleasants AS (WITH pleasants AS(SELECT workid, plaintext,
                    CASE WHEN LOWER(plaintext) LIKE '%%bright%%' OR
                        LOWER(plaintext) LIKE '%%kinder%%' OR
                        LOWER(plaintext) LIKE '%%rapt%%' OR
                        LOWER(plaintext) LIKE '%%satisfied%%' OR
                        LOWER(plaintext) LIKE '%%success%%' OR
                        LOWER(plaintext) LIKE '%%virtues%%' OR
                        LOWER(plaintext) LIKE '%%wise%%' OR
                        LOWER(plaintext) LIKE '%%hero%%' OR
                        LOWER(plaintext) LIKE '%%love%%' OR
                        LOWER(plaintext) LIKE '%%hope%%' OR
                        LOWER(plaintext) LIKE '%%relief%%' 
                    THEN 1
                    ELSE 0
                    END AS pleasant_line
                FROM paragraphs)
SELECT workid, AVG(pleasant_line) as avg_pleasant_line
FROM pleasants
GROUP BY workid)
SELECT AVG(a.avg_pleasant_line) AS avg_pleasant_prop, w.genretype
FROM avg_pleasants a
INNER JOIN works w ON a.workid = w.workid
GROUP BY genretype
'''

pd.read_sql_query(st3, con=engine)

   avg_pleasant_prop genretype
0           0.100136         c
1           0.074423         h
2           0.298172         p
3           0.707792         s
4           0.074186         t

Yes, there is evidence to support that comedies have a higher use of pleasant words than tragedies. The average proportion of pleasant words for comedies is around 0.1 as opposed to around 0.07 for tragedies.

### **Part E**

In [ ]:
eq = '''
SELECT charid, plaintext, wordcount
FROM paragraphs
WHERE charid = 'hamlet'
ORDER BY wordcount DESC LIMIT 1
'''

pd.read_sql_query(eq, con=engine)

   charid                                          plaintext  wordcount
0  hamlet  Ay, so, God b' wi' ye!                        ...      466.0

In [ ]:
print(pd.read_sql_query(eq, con=engine)['plaintext'][0])

Ay, so, God b' wi' ye!                        [Exeunt Rosencrantz and Guildenstern
[p]Now I am alone.
[p]O what a rogue and peasant slave am I!
[p]Is it not monstrous that this player here,
[p]But in a fiction, in a dream of passion,
[p]Could force his soul so to his own conceit
[p]That, from her working, all his visage wann'd,
[p]Tears in his eyes, distraction in's aspect,
[p]A broken voice, and his whole function suiting
[p]With forms to his conceit? And all for nothing!
[p]For Hecuba!
[p]What's Hecuba to him, or he to Hecuba,
[p]That he should weep for her? What would he do,
[p]Had he the motive and the cue for passion
[p]That I have? He would drown the stage with tears
[p]And cleave the general ear with horrid speech;
[p]Make mad the guilty and appal the free,
[p]Confound the ignorant, and amaze indeed
[p]The very faculties of eyes and ears.
[p]Yet I,
[p]A dull and muddy-mettled rascal, peak
[p]Like John-a-dreams, unpregnant of my cause,
[p]And can say nothing! No, not for a king,
[p]Upon whose property and most dear life
[p]A damn'd defeat was made. Am I a coward?
[p]Who calls me villain? breaks my pate across?
[p]Plucks off my beard and blows it in my face?
[p]Tweaks me by th' nose? gives me the lie i' th' throat
[p]As deep as to the lungs? Who does me this, ha?
[p]'Swounds, I should take it! for it cannot be
[p]But I am pigeon-liver'd and lack gall
[p]To make oppression bitter, or ere this
[p]I should have fatted all the region kites
[p]With this slave's offal. Bloody bawdy villain!
[p]Remorseless, treacherous, lecherous, kindless villain!
[p]O, vengeance!
[p]Why, what an ass am I! This is most brave,
[p]That I, the son of a dear father murther'd,
[p]Prompted to my revenge by heaven and hell,
[p]Must (like a whore) unpack my heart with words
[p]And fall a-cursing like a very drab,
[p]A scullion!
[p]Fie upon't! foh! About, my brain! Hum, I have heard
[p]That guilty creatures, sitting at a play,
[p]Have by the very cunning of the scene
[p]Been struck so to the soul that presently
[p]They have proclaim'd their malefactions;
[p]For murther, though it have no tongue, will speak
[p]With most miraculous organ, I'll have these Players
[p]Play something like the murther of my father
[p]Before mine uncle. I'll observe his looks;
[p]I'll tent him to the quick. If he but blench,
[p]I know my course. The spirit that I have seen
[p]May be a devil; and the devil hath power
[p]T' assume a pleasing shape; yea, and perhaps
[p]Out of my weakness and my melancholy,
[p]As he is very potent with such spirits,
[p]Abuses me to damn me. I'll have grounds
[p]More relative than this. The play's the thing
[p]Wherein I'll catch the conscience of the King. Exit.

A part of the speech that demonstrates Hamlet's inner struggle is 

"What would he do,
Had he the motive and the cue for passion
That I have? He would drown the stage with tears
And cleave the general ear with horrid speech;
Make mad the guilty and appal the free,
Confound the ignorant, and amaze indeed
The very faculties of eyes and ears.
Yet I,
A dull and muddy-mettled rascal, peak
Like John-a-dreams, unpregnant of my cause, 
And can say nothing!".

He is guilty that he is being "cowardly" and is unable to express his grief as passionately as someone who he perceives as being more passionate with less to grieve for (I think, I never had to read Shakespeare, so this was really hard to get through).

### Part F

In [ ]:
fq = '''
WITH chapworks AS (SELECT * 
    FROM works w
    INNER JOIN chapters c on w.workid = c.workid)
SELECT title, COUNT(*)
from chapworks
WHERE LOWER(description) LIKE '%%palace%%' OR LOWER(description) LIKE '%%castle%%'
GROUP BY title 
ORDER BY COUNT(*) DESC
'''

pd.read_sql_query(fq, con=engine)

                        title  count
0                     Macbeth     17
1                      Hamlet     15
2   All's Well That Ends Well     15
3                   King Lear     14
4                   Cymbeline     10
5                  Richard II     10
6        Antony and Cleopatra     10
7                     Othello      9
8          Henry VI, Part III      9
9                 Richard III      8
10    Two Gentlemen of Verona      7
11          The Winter's Tale      6
12          Henry IV, Part II      6
13                 Henry VIII      6
14           Henry IV, Part I      5
15                  King John      5
16             As You Like It      4
17           Henry VI, Part I      4
18                    Henry V      4
19                   Pericles      4
20       Troilus and Cressida      4
21          Henry VI, Part II      4
22           Titus Andronicus      3
23              Twelfth Night      3
24    Midsummer Night's Dream      2
25        Measure for Measure      1
26           Comedy of Errors      1

## **Problem 3**

In [65]:
const = requests.get("https://github.com/jkropko/DS-6001/raw/master/localdata/const.json")
const_json = json.loads(const.text)
pd.DataFrame.from_records(const_json).head()

,text,country,adopted,revised,reinstated,democracy
0,'Afghanistan 2004 Preamble \nIn the na...,Afghanistan,2004,NaN,NaN,0.372201
1,'Albania 1998 (rev. 2012) Preamble \nWe...,Albania,1998,2012.0,NaN,0.535111
2,'Andorra 1993 Preamble \nThe Andorran P...,Andorra,1993,NaN,NaN,NaN
3,"'Angola 2010 Preamble \nWe, the people ...",Angola,2010,NaN,NaN,0.315043
4,'Antigua and Barbuda 1981 Preamble \nWH...,Antigua and Barbuda,1981,NaN,NaN,NaN

### Part A

In [70]:
# MongoDB

MONGO_INITDB_ROOT_USERNAME = os.getenv('MONGO_INITDB_ROOT_USERNAME')
MONGO_INITDB_ROOT_PASSWORD = os.getenv('MONGO_INITDB_ROOT_PASSWORD')

myclient = pymongo.MongoClient(f"mongodb://{MONGO_INITDB_ROOT_USERNAME}:{MONGO_INITDB_ROOT_PASSWORD}@localhost:27017/")
myclient.list_databases()

In [71]:
constdb = myclient['constdb']

collist = constdb.list_collection_names()
if 'constitution' in collist:
    constdb.constitution.drop()
    
constitution = constdb['constitution']

constitution.delete_many({})
constitution.insert_many(const_json)

InsertManyResult([ObjectId('68fc50d0b8cf11712c57e6a5'), ObjectId('68fc50d0b8cf11712c57e6a6'), ObjectId('68fc50d0b8cf11712c57e6a7'), ObjectId('68fc50d0b8cf11712c57e6a8'), ObjectId('68fc50d0b8cf11712c57e6a9'), ObjectId('68fc50d0b8cf11712c57e6aa'), ObjectId('68fc50d0b8cf11712c57e6ab'), ObjectId('68fc50d0b8cf11712c57e6ac'), ObjectId('68fc50d0b8cf11712c57e6ad'), ObjectId('68fc50d0b8cf11712c57e6ae'), ObjectId('68fc50d0b8cf11712c57e6af'), ObjectId('68fc50d0b8cf11712c57e6b0'), ObjectId('68fc50d0b8cf11712c57e6b1'), ObjectId('68fc50d0b8cf11712c57e6b2'), ObjectId('68fc50d0b8cf11712c57e6b3'), ObjectId('68fc50d0b8cf11712c57e6b4'), ObjectId('68fc50d0b8cf11712c57e6b5'), ObjectId('68fc50d0b8cf11712c57e6b6'), ObjectId('68fc50d0b8cf11712c57e6b7'), ObjectId('68fc50d0b8cf11712c57e6b8'), ObjectId('68fc50d0b8cf11712c57e6b9'), ObjectId('68fc50d0b8cf11712c57e6ba'), ObjectId('68fc50d0b8cf11712c57e6bb'), ObjectId('68fc50d0b8cf11712c57e6bc'), ObjectId('68fc50d0b8cf11712c57e6bd'), ObjectId('68fc50d0b8cf11712c57e6be'), ObjectId('68fc50d0b8cf11712c57e6bf'), ObjectId('68fc50d0b8cf11712c57e6c0'), ObjectId('68fc50d0b8cf11712c57e6c1'), ObjectId('68fc50d0b8cf11712c57e6c2'), ObjectId('68fc50d0b8cf11712c57e6c3'), ObjectId('68fc50d0b8cf11712c57e6c4'), ObjectId('68fc50d0b8cf11712c57e6c5'), ObjectId('68fc50d0b8cf11712c57e6c6'), ObjectId('68fc50d0b8cf11712c57e6c7'), ObjectId('68fc50d0b8cf11712c57e6c8'), ObjectId('68fc50d0b8cf11712c57e6c9'), ObjectId('68fc50d0b8cf11712c57e6ca'), ObjectId('68fc50d0b8cf11712c57e6cb'), ObjectId('68fc50d0b8cf11712c57e6cc'), ObjectId('68fc50d0b8cf11712c57e6cd'), ObjectId('68fc50d0b8cf11712c57e6ce'), ObjectId('68fc50d0b8cf11712c57e6cf'), ObjectId('68fc50d0b8cf11712c57e6d0'), ObjectId('68fc50d0b8cf11712c57e6d1'), ObjectId('68fc50d0b8cf11712c57e6d2'), ObjectId('68fc50d0b8cf11712c57e6d3'), ObjectId('68fc50d0b8cf11712c57e6d4'), ObjectId('68fc50d0b8cf11712c57e6d5'), ObjectId('68fc50d0b8cf11712c57e6d6'), ObjectId('68fc50d0b8cf11712c57e6d7'), ObjectId('68fc50d0b8cf11712c57e6d8'), ObjectId('68fc50d0b8cf11712c57e6d9'), ObjectId('68fc50d0b8cf11712c57e6da'), ObjectId('68fc50d0b8cf11712c57e6db'), ObjectId('68fc50d0b8cf11712c57e6dc'), ObjectId('68fc50d0b8cf11712c57e6dd'), ObjectId('68fc50d0b8cf11712c57e6de'), ObjectId('68fc50d0b8cf11712c57e6df'), ObjectId('68fc50d0b8cf11712c57e6e0'), ObjectId('68fc50d0b8cf11712c57e6e1'), ObjectId('68fc50d0b8cf11712c57e6e2'), ObjectId('68fc50d0b8cf11712c57e6e3'), ObjectId('68fc50d0b8cf11712c57e6e4'), ObjectId('68fc50d0b8cf11712c57e6e5'), ObjectId('68fc50d0b8cf11712c57e6e6'), ObjectId('68fc50d0b8cf11712c57e6e7'), ObjectId('68fc50d0b8cf11712c57e6e8'), ObjectId('68fc50d0b8cf11712c57e6e9'), ObjectId('68fc50d0b8cf11712c57e6ea'), ObjectId('68fc50d0b8cf11712c57e6eb'), ObjectId('68fc50d0b8cf11712c57e6ec'), ObjectId('68fc50d0b8cf11712c57e6ed'), ObjectId('68fc50d0b8cf11712c57e6ee'), ObjectId('68fc50d0b8cf11712c57e6ef'), ObjectId('68fc50d0b8cf11712c57e6f0'), ObjectId('68fc50d0b8cf11712c57e6f1'), ObjectId('68fc50d0b8cf11712c57e6f2'), ObjectId('68fc50d0b8cf11712c57e6f3'), ObjectId('68fc50d0b8cf11712c57e6f4'), ObjectId('68fc50d0b8cf11712c57e6f5'), ObjectId('68fc50d0b8cf11712c57e6f6'), ObjectId('68fc50d0b8cf11712c57e6f7'), ObjectId('68fc50d0b8cf11712c57e6f8'), ObjectId('68fc50d0b8cf11712c57e6f9'), ObjectId('68fc50d0b8cf11712c57e6fa'), ObjectId('68fc50d0b8cf11712c57e6fb'), ObjectId('68fc50d0b8cf11712c57e6fc'), ObjectId('68fc50d0b8cf11712c57e6fd'), ObjectId('68fc50d0b8cf11712c57e6fe'), ObjectId('68fc50d0b8cf11712c57e6ff'), ObjectId('68fc50d0b8cf11712c57e700'), ObjectId('68fc50d0b8cf11712c57e701'), ObjectId('68fc50d0b8cf11712c57e702'), ObjectId('68fc50d0b8cf11712c57e703'), ObjectId('68fc50d0b8cf11712c57e704'), ObjectId('68fc50d0b8cf11712c57e705'), ObjectId('68fc50d0b8cf11712c57e706'), ObjectId('68fc50d0b8cf11712c57e707'), ObjectId('68fc50d0b8cf11712c57e708'), ObjectId('68fc50d0b8cf11712c57e709'), ObjectId('68fc50d0b8cf11712c57e70a'), ObjectId('68fc50d0b8cf11712c57e70b'), ObjectId('68fc50d0b8cf11712c57e70c'), ObjectId('68fc50d0b8cf11712c57e70d'), ObjectId('68fc50d0b8cf11712c57e70e'), ObjectId('68fc50d0b8cf11712c57e70f'), ObjectId('68fc50d0b8cf11712c57e710'), ObjectId('68fc50d0b8cf11712c57e711'), ObjectId('68fc50d0b8cf11712c57e712'), ObjectId('68fc50d0b8cf11712c57e713'), ObjectId('68fc50d0b8cf11712c57e714'), ObjectId('68fc50d0b8cf11712c57e715'), ObjectId('68fc50d0b8cf11712c57e716'), ObjectId('68fc50d0b8cf11712c57e717'), ObjectId('68fc50d0b8cf11712c57e718'), ObjectId('68fc50d0b8cf11712c57e719'), ObjectId('68fc50d0b8cf11712c57e71a'), ObjectId('68fc50d0b8cf11712c57e71b'), ObjectId('68fc50d0b8cf11712c57e71c'), ObjectId('68fc50d0b8cf11712c57e71d'), ObjectId('68fc50d0b8cf11712c57e71e'), ObjectId('68fc50d0b8cf11712c57e71f'), ObjectId('68fc50d0b8cf11712c57e720'), ObjectId('68fc50d0b8cf11712c57e721'), ObjectId('68fc50d0b8cf11712c57e722'), ObjectId('68fc50d0b8cf11712c57e723'), ObjectId('68fc50d0b8cf11712c57e724'), ObjectId('68fc50d0b8cf11712c57e725'), ObjectId('68fc50d0b8cf11712c57e726'), ObjectId('68fc50d0b8cf11712c57e727'), ObjectId('68fc50d0b8cf11712c57e728'), ObjectId('68fc50d0b8cf11712c57e729'), ObjectId('68fc50d0b8cf11712c57e72a'), ObjectId('68fc50d0b8cf11712c57e72b'), ObjectId('68fc50d0b8cf11712c57e72c'), ObjectId('68fc50d0b8cf11712c57e72d'), ObjectId('68fc50d0b8cf11712c57e72e'), ObjectId('68fc50d0b8cf11712c57e72f'), ObjectId('68fc50d0b8cf11712c57e730'), ObjectId('68fc50d0b8cf11712c57e731'), ObjectId('68fc50d0b8cf11712c57e732'), ObjectId('68fc50d0b8cf11712c57e733'), ObjectId('68fc50d0b8cf11712c57e734'), ObjectId('68fc50d0b8cf11712c57e735')], acknowledged=True)

### Part B

#### Query 1

In [74]:
def mongo_query(collection, row_query={}, col_query={}):
    find = collection.find(row_query, col_query)
    find_dump = dumps(find)
    find_loads = loads(find_dump)
    return find_loads

In [75]:
q1 = {
 "adopted":{
 "$gt": 1990
 }
}

In [76]:
results = mongo_query(constitution, 
            row_query=q1, 
            col_query={'country':1,'adopted':1,'democracy':1})
pd.DataFrame(results).head()

                        _id      country  adopted  democracy
0  68fc50d0b8cf11712c57e6a5  Afghanistan     2004   0.372201
1  68fc50d0b8cf11712c57e6a6      Albania     1998   0.535111
2  68fc50d0b8cf11712c57e6a7      Andorra     1993        NaN
3  68fc50d0b8cf11712c57e6a8       Angola     2010   0.315043
4  68fc50d0b8cf11712c57e6aa      Armenia     1995   0.393278

#### Query 2

In [77]:
q2 = {
 "adopted":{"$gt": 1990},
 "democracy":{"$lt": 0.5}
}

In [78]:
results1 = mongo_query(constitution, 
            row_query=q2, 
            col_query={'country':1,'adopted':1,'democracy':1})
pd.DataFrame(results1).head() # truncated (full outputs 38 rows)

                        _id                 country  adopted  democracy
0  68fc50d0b8cf11712c57e6a5             Afghanistan     2004   0.372201
1  68fc50d0b8cf11712c57e6a8                  Angola     2010   0.315043
2  68fc50d0b8cf11712c57e6aa                 Armenia     1995   0.393278
3  68fc50d0b8cf11712c57e6b1                 Belarus     1994   0.289968
4  68fc50d0b8cf11712c57e6b5  Bosnia and Herzegovina     1995   0.338267

#### Query 3

In [79]:
q3 = {"$or":[ {"adopted":{"$gt": 1990}},
              {"democracy":{"$lt": 0.5}}
              ]
}

In [80]:
results2 = mongo_query(constitution, 
            row_query=q3, 
            col_query={'country':1,'adopted':1,'democracy':1})
pd.DataFrame(results2).head() # truncated output (full outputs 83 rows)

                        _id      country  adopted  democracy
0  68fc50d0b8cf11712c57e6a5  Afghanistan     2004   0.372201
1  68fc50d0b8cf11712c57e6a6      Albania     1998   0.535111
2  68fc50d0b8cf11712c57e6a7      Andorra     1993        NaN
3  68fc50d0b8cf11712c57e6a8       Angola     2010   0.315043
4  68fc50d0b8cf11712c57e6aa      Armenia     1995   0.393278

### Part C

In [81]:
constitution.update_one({'country': 'Hungary'},
                          {'$set': {'democracy': 0.4}})
pd.DataFrame(mongo_query(constitution, {'country': 'Hungary'}))

,_id,text,country,adopted,revised,reinstated,democracy
0,68fc50d0b8cf11712c57e6d7,'Hungary 2011 (rev. 2013) Preamble \nGo...,Hungary,2011,2013.0,None,0.4

### Part D

In [82]:
constitution.create_index([('text', 'text')])

'text_text'

In [83]:
dq = {'$text': {'$search': '\"freedom of speech\"', '$caseSensitive': False}}

In [84]:
results3 = mongo_query(constitution, 
            row_query=dq, 
            col_query={'country':1,'adopted':1,'democracy':1,'_id':0})
pd.DataFrame(results3).head() # truncated (full outputs 52 rows)

                                       country  adopted  democracy
0                                     Slovenia     1991   0.861380
1                                       Poland     1997   0.682208
2                                      Eritrea     1997   0.075621
3                                      Croatia     1991   0.710922
4  Macedonia (The former Yugoslav Republic of)     1991   0.510983

### Part E

In [85]:
cursor = constitution.find(
            {'$text': {'$search': 'freedom liberty legal justice rights'}},
            {'score': {'$meta': 'textScore'}})

In [86]:
cursor.sort([('score', {'$meta': 'textScore'})])

In [87]:
qtext = dumps(cursor)
qrec = loads(qtext)
df = pd.DataFrame.from_records(qrec)

In [49]:
df.head(10)

,_id,text,country,adopted,revised,reinstated,democracy,score
0,68fb9c0db8cf11712c57e684,'Serbia 2006 Preamble \nConsidering the...,Serbia,2006,NaN,NaN,0.474443,5.030999
1,68fb9c0db8cf11712c57e63c,'Finland 1999 (rev. 2011) Chapter 1. Funda...,Finland,1999,2011.0,NaN,0.856265,5.029000
2,68fb9c0db8cf11712c57e639,'Estonia 1992 (rev. 2011) Preamble \nWi...,Estonia,1992,2011.0,NaN,0.909233,5.024473
3,68fb9c0db8cf11712c57e618,'Armenia 1995 (rev. 2005) Preamble \nTh...,Armenia,1995,2005.0,NaN,0.393278,5.023651
4,68fb9c0db8cf11712c57e614,'Albania 1998 (rev. 2012) Preamble \nWe...,Albania,1998,2012.0,NaN,0.535111,5.023087
5,68fb9c0db8cf11712c57e633,"'Dominican Republic 2015 Preamble \nWe,...",Dominican Republic,2015,NaN,NaN,0.583654,5.019910
6,68fb9c0db8cf11712c57e667,'Moldova (Republic of) 1994 (rev. 2006) Pr...,Moldova (Republic of),1994,2006.0,NaN,0.571357,5.017063
7,68fb9c0db8cf11712c57e636,'El Salvador 1983 (rev. 2014) TITLE I ...,El Salvador,1983,2014.0,NaN,0.661989,5.016899
8,68fb9c0db8cf11712c57e63f,'Georgia 1995 (rev. 2013) Preamble \nWe...,Georgia,1995,2013.0,NaN,0.757486,5.015282
9,68fb9c0db8cf11712c57e698,'Turkey 1982 (rev. 2011) Preamble \nAff...,Turkey,1982,2011.0,NaN,0.341745,5.014672